print("Завдання 7-1")
print()
set_1={4,2,6,8,'hello'}
set_2={5,4,3,'rty','hello'}
print(set_2 & set_1)
print("-"*40)


print("Завдання 2")
print()
a={}
x=-1
while x:
   x = input("1-для ввода; 2-для вывода; 0-ВЫХОД:")
   match x:
      case '1':
         fullName = input("Введіть повну назву: ")
         shortName = input(f"Введіть коротку назву для {fullName}:")
         #     {"google": "https://www.google.com/",
         #     "meta": "https://meta.ua/uk/",
         #     "i.ua": "http://www.i.ua/"}
         a[shortName] = fullName
      case '2':
         p = input("Для отримання посилання введіть коротку назву: ")
         print(a[p])
      case '0':
         break
      case _:
         pass
print("_"*40)


print("Завдання 3")
print()
a={7,5,3,4,2}
b={9,5,1,2,6}
print(f"список унікальних значень без повтору, які є в 1 списку: ",a-b)
print(f"список унікальних значень без повтору, які є в 2 списку: ",b-a)
print("-"*40)


print("Завдання 5")
print()
from collections import Counter

a_txt=("""І Господь промовляв до Мойсея в Сінайській пустині в скинії заповіту першого дня другого місяця, другого року від виходу їх з єгипетського краю, говорячи:
2 Перелічіть усю громаду Ізраїлевих синів за родами їхніми, за домами їхніх батьків числом усіх чоловічої статі за їх головами,
3 від віку двадцяти літ і вище, кожного, хто здатний до війська в Ізраїлі, за військовими відділами їхніми перелічіть їх ти та Аарон.
4 А з вами будуть по одному мужеві для племени; той муж голова дому батьків своїх він.
5 А оце ймення тих мужів, що стануть із вами: для Рувима Еліцур, син Шедеурів;
6 для Симеона Шелуміїл, син Цурішаддаїв;
7 для Юди Нахшон, син Аммінадавів;
8 для Іссахара Натанаїл, син Цуарів;
9 для Завулона Елів, син Хелонів;
10 для Йосипових синів, від Єфрема Елішама, син Аммігудів; від Манасії Гамаліїл, син Педацурів;
11 для Веніямина Авідан, син Ґід'оніїв;
12 для Дана Ахіезер, син Аммішаддаїв;
13 для Асира Паґ'іїл, син Охранів;
14 для Ґада Ел'ясаф, син Деуїлів;
15 для Нефталима Ахіра, син Енанів.
16 Оце покликані громади, начальники племен їхніх батьків. Вони голови тисяч Ізраїлевих.
17 І взяв Мойсей та Аарон тих мужів, що були названі пойменно,
18 і вони зібрали всю ту громаду першого дня другого місяця. І вони виявили родоводи свої за домами їхніх батьків числом імен від віку двадцяти літ і вище, за головами їх,
19 як Господь наказав був Мойсеєві. І він перелічив їх у Сінайській пустині.
20 І було синів Рувима, перворідного Ізраїлевого, їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен за головами їх, усіх чоловічої статі від віку двадцяти літ і вище, кожен, хто здатний до війська,
21 перелічені їхні від Рувимового племені сорок і шість тисяч і п'ятсот.
22 У Симеонових синів їхніх нащадків за їхніми родами, за домами їхніх батьків перелік їх числом імен за головами їхніми, усі чоловічої статі від віку двадцяти літ і вище, кожен, хто здатний до війська,
23 перелічені їхні від Симеонового племени п'ятдесят і дев'ять тисяч і триста.
24 У Ґадових синів їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен від віку двадцяти літ і вище, кожен, хто здатний до війська,
25 перелічені їхні від Ґадового племени сорок і п'ять тисяч і шістсот і п'ятдесят.
26 У Юдових синів їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен від віку двадцяти літ і вище, кожен, хто здатний до війська,
27 перелічені їхні від Юдового племени сімдесят і чотири тисячі й шістсот.
28 У Іссахарових синів їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен від віку двадцяти літ і вище, кожен, хто здатний до війська,
29 перелічені їхні від Іссахарового племени п'ятдесят і чотири тисячі й чотириста.
30 У Завулонових синів їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен від віку двадцяти літ і вище, кожен, хто здатний до війська,
31 перелічені їхні від Завулонового племени п'ятдесят і сім тисяч і чотириста.
32 У Йосипових синів: у Єфремових синів їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен від віку двадцяти літ і вище, кожен, хто здатний до війська,
33 перелічені їхні від Єфремового племени сорок тисяч і п'ятсот.
34 У синів Манасії їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен від віку двадцяти літ і вище, кожен, хто здатний до війська,
35 перелічені їхні від племени Манасіїного тридцять і дві тисячі й двісті.
36 У Веніяминових синів їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен від віку двадцяти літ і вище, кожен, хто здатний до війська,
37 перелічені їхні від Веніяминового племени тридцять і п'ять тисяч і чотириста.
38 У Данових синів їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен від віку двадцяти літ і вище, кожен, хто здатний до війська,
39 перелічені їхні від Данового племени шістдесят і дві тисячі й сімсот.
40 У Асирових синів їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен від віку двадцяти літ і вище, кожен, хто здатний до війська,
41 перелічені їхні від Асирового племени, сорок і одна тисяча й п'ятсот.
42 У синів Нефталимових їхніх нащадків за їхніми родами, за домами їхніх батьків числом імен від віку двадцяти літ і вище, кожен, хто здатний до війська,
43 перелічені їхні від племени Нефталимового п'ятдесят і три тисячі й чотириста.
44 Оце ті перелічені, кого перелічив Мойсей й Аарон та Ізраїлеві начальники, дванадцятеро мужа, вони були по одному мужеві для дому батьків своїх.
45 І були всі перелічені з Ізраїлевих синів за домами батьків своїх від віку двадцяти літ і вище, кожен, хто здатний до війська, в Ізраїлі,
46 і були всі перелічені шістсот тисяч і три тисячі й п'ятсот і п'ятдесят.
47 А Левити не були перелічені серед них за племенем батьків своїх.
48 І Господь промовляв до Мойсея, говорячи:
49 Тільки Левієвого племени не переглянеш і не перелічиш їх серед Ізраїлевих синів.
50 А ти постав Левитів наглядачами над скинією свідоцтва, і над усіма речами її та над усім, що її. Вони будуть носити скинію та всі її речі, і вони будуть обслуговувати її, і отаборяться навколо скинії.
51 А коли скинія буде рушати, Левити розберуть її, а коли буде спинятися скинія, Левити поставлять її. А якщо наблизиться чужий, він нехай буде забитий.
52 І отаборяться Ізраїлеві сини кожен у таборі своїм, і кожен при своїм прапорі за своїми військовими відділами.
53 А Левити отаборяться навколо скинії свідоцтва, щоб не було гніву на громаду Ізраїлевих синів. І будуть Левити виконувати сторожу скинії свідоцтва.
54 І зробили Ізраїлеві сини, згідно зо всім, як наказав був Господь Мойсеєві, так зробили вони.
І Господь промовляв до Мойсея та до Аарона, говорячи:
2 Отаборяться Ізраїлеві сини кожен при прапорі своїм за ознаками домів своїх батьків, навпроти скинії заповіту навколо отаборяться.
3 Напереді на схід отаборяться: прапор Юдиного табору за своїми військовими відділами, а начальник Юдиних синів Нахшон, син Аммінадавів;
4 а його військо та його перелік сімдесят і чотири тисячі й шістсот.
5 А при ньому отабориться Іссахарове плем'я, а начальник Іссахарових синів Натанаїл, син Цуарів;
6 а його військо та його перелік п'ятдесят і чотири тисячі й чотириста. """).split()
#print(len(a_txt))
counter=Counter(a_txt)
print(counter)
print("-"*40)



print("Завдання 7-6")
print()
library = {'Забара Натан': "Люди і час",
           'Балясна': "Дівчина з Іванкова",
           'Балла Карой': "Почуй музику вві сні"}
print(library)

x = -1
while x:
   x = input("1-для перегляду; 2-для внесення змін; 0-ВИХІД:")
   sorted_dict = {}
   match x:
      case '1':
         y = input('1-для перегляду за автором; 2-за твором; 0-ВИХІД:')
         if y == '1':  # сортування за автором
            sorted_keys = sorted(library.keys())

            for key in sorted_keys:
               print(f"{key} - {library[key]}")
         elif y == '2':  # сортування за твором
            sorted_values = sorted(library.values())

            for val in sorted_values:
               for key in library.keys():
                  if library[key] == val:
                     sorted_dict[key] = val
                     print(f"{key} - {sorted_dict[key]}")
      case '2':
         y = input('1-для видалення запису; 2-для зміни інформації; 0-ВИХІД:')
         if y == '1':  # Видалення
            in_data = input("Введіть автора чи назву книги: ")

            if in_data in library.keys() or in_data in library.values():
               for key in library.keys():
                  if in_data == key or in_data == library[key]:
                     print(f"Книгу {library.pop(key)} від {key} було видалено!")
                     break
            else:
               print("Такої книги/автора не було знайдено!")
         elif y == '2':  # Внесення змін
            in_data = input("Введіть автора чи назву книги: ")

            if in_data in library.keys():
               new_autor = in_data
               new_book_name = input("Змінена нова назва книги: ")
            elif in_data in library.values():
               del_key = ''
               for k, v in library.items():
                  if v == in_data:
                     new_book_name = in_data
                     new_autor = input(f"Введіть нового автора для '{new_book_name}': ")
                     del_key = k
               del (library[del_key])
            else:
               print(f"Інформація не знайдена!")
               new_autor = input("Введіть нового автора для додавання: ")
               new_book_name = input("Введіть нову назву книги: ")
            library[new_autor] = new_book_name
            print(f"В {new_autor} - {library[new_autor]} зміни внесено!")

      case '0':
         break
      case _:
         print("Помилкове введення")
print("-"*40)

from collections import OrderedDict

print("Завдання 7")
print()
base = OrderedDict({'Anna': {'position': 'manager1', 'expirience': 1, 'portfolio': '111', 'kpi': 1.0,
                             'tech_stek': 'aaa', 'ammount': 1000.0},\
                    'Petya': {'position': 'manager2', 'expirience': 2, 'portfolio': '222', 'kpi': 2.0,
                              'tech_stek': 'bbb', 'ammount': 2000.0},\
                    'Masha': {'position': 'manager3', 'expirience': 3, 'portfolio': '333', 'kpi': 3.0,
                              'tech_stek': 'ccc', 'ammount': 3000.0}})
print(base)

x = -1
while x:
   x = input("1-для перегляду; 2-для внесення змін; 0-ВИХІД:")

   match x:
      case '1':
         y = input('1-для перегляду за прізвищем; 2-за ефективністю; 0-ВИХІД:')
         if y == '1':  # сортування за прізвищем
            for k, v in sorted(base.items()):
               print(f'{k}:', end='')
               for key, val in v.items():
                  print(f'\t{key}: {val}, ', end='')
               print()

         elif y == '2':  # сортування за KPI
            for k, v in sorted(base.items(), key=lambda x: x[1]['kpi'], reverse=True):
               print(f'{k}:', end='')
               for key, val in v.items():
                  print(f'\t{key}: {val}, ', end='')
               print()
      case '2':
         y = input('1-для видалення запису; 2-для зміни інформації; 0-ВИХІД:')
         match y:
            case '1':  # Видалення
               in_data = input("Введіть ім'я співробітника: ").lower().capitalize()
               if in_data in base.keys():
                  y_n = input(f'Ви дійсно бажаєте видалити дані співробітника {in_data}? (y/n)').lower()
                  if y_n == 'y':
                     # pop_item = base[in_data]
                     print(f'Було видалено: \n{in_data} - ', end='')
                     for key in base[in_data].keys():
                        print(f'\t{key}: {base[in_data][key]}')
                     del (base[in_data])
               else:
                  print("Такого імені не було знайдено!")
            case '2':  # Внесення змін
               in_data = input("Введіть ім'я співробітника: ").lower().capitalize()

               if in_data in base.keys():
                  print(f'Співробітника {in_data} знайдено в базі:')
                  for k, v in base[in_data].items():
                     print(f'{k} - {v}')
                  y = input('1-для зміни імені; 2-для зміни даних; 0-ВИХІД:')
                  match y:
                     case '1':
                        new_name = input(f"Введіть нове ім'я співробітника:").lower().capitalize()
                        base.update({new_name: base[in_data]})

                        print(f'Було змінено \"{in_data}\" на \"{new_name}\":')
                        for k, v in base[new_name].items():
                           print(f'{k} - {v}')
                        del (base[in_data])
                     case '2':
                        print(f'Введіть по черзі нові дані співробітника \"{in_data}\" (ENTER - дані залишаються):')

                        new_position = input(f"Введіть нову посаду ({base[in_data]['position']}):").lower().capitalize()
                        if new_position == '':
                           new_position = base[in_data]['position']

                        new_expirience = input(f"Введіть стаж ({base[in_data]['expirience']}):")
                        if new_expirience.isdigit():
                           new_expirience = int(new_expirience)
                        elif new_expirience == '':
                           new_expirience = base[in_data]['expirience']
                        else:
                           print("Помилкове введення!")
                           new_expirience = base[in_data]['expirience']

                        new_portfolio = input(f"Заповніть портфоліо ({base[in_data]['portfolio']}): ")
                        if new_portfolio == '':
                           new_portfolio = base[in_data]['portfolio']

                        temp = input(f"Введіть KPI ({base[in_data]['kpi']}):")
                        if temp.isdigit():
                           new_kpi = float(temp)
                        elif temp == '':
                           new_kpi = base[in_data]['kpi']
                        else:
                           print("Помилкове введення!")
                           new_kpi = base[in_data]['kpi']

                        new_tech_stek = input(f"Введіть технічний стек ({base[in_data]['tech_stek']}): ")
                        if new_tech_stek == '':
                           new_tech_stek = base[in_data]['tech_stek']

                        new_ammount = input(f"Введіть зарплату ({base[in_data]['ammount']}):")
                        if new_ammount.isdigit():
                           new_ammount = float(new_ammount)
                        elif new_ammount == '':
                           new_ammount = base[in_data]['ammount']
                        else:
                           print("Помилкове введення!")
                           new_ammount = base[in_data]['ammount']

                        base.update({in_data: {'position': new_position, 'expirience': new_expirience,
                                               'portfolio': new_portfolio, 'kpi': new_kpi, 'tech_stek': new_tech_stek,
                                               'ammount': new_ammount}})
                     case '0':
                        break
                     case _:
                        print("Помилкове введення!")
               else:
                  print("Інформація не знайдена!")
            case '0':
               break
            case _:
               print("Помилкове введення!")
      case '0':
         break
      case _:
         print("Помилкове введення")
         x = -1
